#+TITLE: Polars / Numpy cheatsheet
#+PROPERTY: header-args:python :session *Python* :results output :exports both

* Numpy

** Vectors

#+begin_src python
  import numpy as np

  # Define array
  v = np.array([3,1,4,1,5,9])
  print(v)
  print(type(v))

  # subset
  print(v[[1,3,5]])
  print(v[2:])

  # vectorized ops
  print(v**3)

  # scalar addition allowed, but no general length recycling like R
  print(v+3) # adds 3 to every element
  # print(v+np.array([1,2])) # throws

#+end_src

#+RESULTS:
: [3 1 4 1 5 9]
: <class 'numpy.ndarray'>
: [1 1 9]
: [4 1 5 9]
: [ 27   1  64   1 125 729]
: [ 6  4  7  4  8 12]
: 1
